[
  {
    "제목": "AWS Step Functions",
    "설명": "시각적 워크플로를 사용하여 분산 애플리케이션과 마이크로 서비스의 구성 요소를 손쉽게 조정할 수 있게 해주는 완전관리형 서비스 . 각각 기능을 수행하는 개별 구성 요소를 사용하여 애플리케이션을 구축하면 애플리케이션을 빠르고 쉽 게 확장하거나 변경할 수 있다. ​"
  },
  {
    "제목": "AWS X-Ray",
    "설명": "개발자가 프로덕션 분산 애플리케이션 (예: 마이크로 서비스 아키텍처를 사용해 구축된 애플리케이션 )을 분석하고 디버깅하는 데 도움을 주는 서비스 . 자신이 개발한 애플리케이션과 기본 서비스가 성능 문제 와 오류의 근본 원인 식별과 문제 해결을 올바로 수행하는지 파악할 수 있다.요청이 애플리케이션을 통 과함에 따라 요청에 대한 엔드 투 엔드 뷰를 제공하고 애플리케이션의 기본 구성 요소를 맵으로 보여 준다. 간단한 3-티어 애플리케이션에서부터 수천 개의 서비스로 구성된 복잡한 마이크로 서비스 애플리 케이션에 이르기까지 개발 중인 애플리케이션과 프로덕션에 적용된 애플리케이션 모두 분석할 수 있다.사용 사례 데이터 처리DevOps 및 IT 자동 화전자 상거래 웹 애플리케이션 여러 데이터베이스의 데이터를 통일된 보고서로 통합, 대규모 데이터 세트를 유용한 형식으로 세분 화 및 축소 또는 다단 계 분석 및 기계 학습 워크플로 조 정지속적 통합 및 지속적 배포를 위한 도구 구축 또는 인프라의 변경에 자동으로 대응하는 이 벤트 중심 애플리케이션 생성주문 이행, 재고 추적 등 미션 크리티컬 비즈 니스 프로세스 자동화강력한 사용자 등록 프 로세스와 로그인 인증 구현 서비스 맵 생성 오류 및 버그 파악 자체 분석 및 시각화 앱 구축 애플리케이션에 전송된 요청을 추적함으로써 애플리케이션에서 애플리케이션에 전송된 각 요청 의 응답 코드를 분석함으로써 X-Ray 에서 기록한 데이터를 사 용하는 자체 분석 및 시각화 앱 Amazon S3 Transfer Acceleration 클라이언트와 S3 버킷 간의 장거리에서 파일을 빠르고 쉽고 안전하게 전송할 수 있는 버킷 수준 기능 이다. 전 세계에서 S3 버킷으로의 전송 속도를 최적화 하도록 설계되었다 . Amazon CloudFront 의 전 세계적으로 분산되어 있는 엣지 로케이션을 활용한다 . 데이터가 엣지 로케이 션에 도착하면 데이터는 최적화된 네트워크 경로를 통해 Amazon S3으로 라우팅 된다. ​ Transfer Acceleration 사용하는 이유 전 세계 각지에서 중앙의 버킷으로 업로드하는 고객이 있는 경우 전 세계에 정기적으로 수 기가바이트에서 수 테라바이트의 데이터를 전송할 경우 Amazon S3에 업로드할 때 인터넷을 통해 사용 가능한 대역폭을 충분히 활용할 수 없는 경우 Amazon S3 조건 키사용하는 서비스 맵을 생성할 수 있다. 서비스 맵은 애플리케이션의 서 비스가 서로 어떻게 연결되어 있는지 보여준다 . 또한, 이를 사용하면 종속성 트 리를 생성하고 AWS 가용 영역 이나 리전에 걸쳐 작업할 때 지 연 시간 또는 오류를 탐지하며 , 의도대로 작동하지 않는 서비스 를 바로 잡을 수 있다.애플리케이션 코드의 버그 또는 오류를 자동으로 표시할 수 있 다. 따라서 버그 또는 오류를 재현 할 필요 없이 애플리케이션 코 드를 쉽게 디버깅할 수 있다.을 구축할 수 있도록 쿼리 API 세트를 제공한다 . aws:PrincipalOrgID aws:PrincipalTag aws:PrincipalOrgPaths IAM 보안 주체의 AWS Organizations 을 사용하여 AWS 리소스에 대한 액세스를 제어하 도록 설계되어있다 . 리소스 기반 정책에서 aws:PrincipalOrgID 조건 키를 사용하여 AWS Organizations 의 계정에서 IAM 보안 주체에 대 한 액세스를 요청 주체에 부착된 태그를 IAM 정책의 태그와 일치시키는 데 사용된다 . PrincipalTag 키의 값은 요청 주 체가 있는 경우 IAM 태그의 값 과 일치하는 태그 키의 값과 함 께 입력한다 .요청 중인 보안 주체의 AWS Organizations 경로를 정책의 경로와 비교한다 . 요청자가 AWS Organizations 의 지정된 조직 루트 또는 조직 단 위(OU) 내의 계정 멤버인지 확 인한다 . Amazon Kinesis Data Streams 특수 요구에 맞춰 스트리밍 데이터를 처리 또는 분석하는 사용자 지정 애플리케이션을 구축할 수 있다. 수십 만개의 소스에서 클릭 스트림 , 애플리케이션 로그, 소셜 미디어와 같은 다양한 유형의 데이터를 Kinesis 데이터 스트림에 추가할 수 있으며 몇 초 안에 애플리케이션에서 스트림의 해당 데이터를 읽고 처리할 수 있다. ​ 자동으로 수행하는 관리작업 AWS Lambda 와 빠르게 페어링 ​ Amazon Kinesis Data Firehose 스트리밍 ETL 솔루션 . 스트리밍 데이터를 데이터 스토어와 분석 도구에 로드하는 가장 쉬운 방 법이다 . 스트리밍 데이터를 캡처하고 변환한 후 Amazon S3, Amazon Redshift, Amazon OpenSearch Service 및 Splunk 로 로드하여 이미 사용하고 있는 기존 비즈니스 인텔리전스 도구 및 대시보드 를 통해 거의 실시간으로 분석할 수 있다. 데이터 처리량에 맞춰 자동으로 크기가 조정되며 지속적인 관리가 필요 없는 완전관리형 서비스 이며, 데이터를 로드하기 전에 배치, 압축 및 암호화하여 대상 스토리지의 사용량을 최소화하고 보안을 강화할 수 있다. ​ Kinesis Data Stream / Kinesis Data Firehose Kinesis Data Streams : 실시간으로 데이터를 수집 및 캡쳐 Kinesis Data Firehose : 수집 및 캡쳐된 데이터를 분석 서비스로 로드 및 전송은 소스에서 로그 및 이벤트 데 이터를 수집한다 . 그런 다음 Amazon Lambda 또 는 Kinesis Data Analytics 를 사 용하여 애플리케이션을 구축하 여 지속적으로 데이터를 처리하 고, 지표를 생성하고 , 라이브 대시보드를 구동하고 , 집계된 데이터를 Amazon Simple Storage Service(S3) 등의 저장 소로 내보낼 수 있다.하여 규모에 상관없이 환경의 이벤트 기반 애플리케이션 내에 서 즉각적인 발생에 대응하거나 조정한다 . Kinesis Data Stream Kinesis Data Firehose 역할AWS LambdaAWS 서비스의 실시 간 데이터 스트림을 제공한 다음, 해당 데이터를 AWS Lambda 등의 대상으로 라우팅한다 . 데이터를 전송할 대상을 결정하는 라우팅 규 칙을 설정하여 모든 데이터 원본에 실시간으로 대응하는 애플리케이션 아키텍처를 구축할 수 있다. EventBridge 를 사용하면 느슨하게 결합되고 분산된 이벤트 중심 아키텍처를 구축할 수 있다."
  },
  {
    "제목": "AWS CloudTrail",
    "설명": "사용자 활동 및 API 사용을 추적하여 감사, 보안 모니터링 및 운영 문제 해결을 지원한다 . CloudTrail 은 AWS 인프라 전체에서 작업과 관련된 계정 활동을 로그하고 지속적으로 모니터링하고 보존하여 스토리 지, 분석 및 해결 작업을 제어할 수 있도록 한다. CloudTrail 은 모든 클라이언트의 API 호출을 기록한 다. AWS 관리 콘솔, AWS 소프트웨어 개발 키트(SDK), 명령줄 도구, 상위 수준 AWS 서비스에서 AWS API를 호출하며 이 모두가 기록된다 . ​ keyword - API호출"
  },
  {
    "제목": "AWS Batch",
    "설명": "개발자 , 과학자 및 엔지니어가 AWS에서 수많은 배치 컴퓨팅 작업을 효율적으로 손쉽게 실행할 수 있 게 해주는 배치 관리 기능 세트이다 . 제출된 배치 작업의 볼륨 및 특정 리소스 요구 사항에 따라 최적 의 수량 및 컴퓨팅 리소스의 유형(예: CPU 또는 메모리 최적화 컴퓨터 리소스 )을 동적으로 프로비저닝 한다. 작업 실행을 위한 배치 컴퓨팅 소프트웨어나 서버 클러스터를 설치하여 관리할 필요가 없으므로 결과 분석과 문제 해결에 집중할 수 있다. Amazon ECS, Amazon EKS 및 AWS Fargate 를 사용하여 배치 컴퓨팅 워크로드를 계획, 예약 및 실행 하며 스팟 인스턴스를 활용할 수 있는옵션을 제공한다 . Amazon QuickSight 조직 내 모든 구성원에게 통찰력을 손쉽게 제공할 수 있는 빠른 클라우드 기반 데이터 시각화 도구이 다. 어떠한 데이터를 사용할지에 대해 데이터셋을 설정해주면 간단히 데이터를 통해서 차트나 그래프 형태 로 데이터를 시각화하고 분석한다 . 비용 측면에서 세션별 지불 결제 모델을 사용하여 사용량에 대해서만 요금을 지불하면 된다. ​ QuickSight 특징 •다양한 데이터 지원 •신속한 결과 제공 •빠르고 직관적인 시각화 •임베디드 분석 ​ 개별 Amazon QuickSight 사용자 및 그룹에게 Amazon QuickSight 의 대시보드에 대한 액세스 권한 부 여 방법 AWS의 Kubernetes 실행에 사용할 수 있는 관리형 서비스 . Kubernetes 는 컨테이너화된 애플리케이션의 배포, 확장, 관리를 자동화하기 위한 오픈 소스 시스템 . ​ •고가용성을 보장하기 위해 여러 AWS 가용 영역에서 Kubernetes 제어 플레인을 실행하고 확 장한다 . •로드를 기반으로 컨트롤 플레인 인스턴스를 자동으로 확장하고 비정상 컨트롤 플레인 인스턴 스를 감지 및 교체하며 자동화된 버전 업데이트 및 패치를 제공한다 . •다음 기능을 포함하여 애플리케이션에 대한 확장성과 보안을 제공하기 위해 많은 AWS 서비 스와 통합된다 AWS 클라우드가 제공하는 확장성 , 유연성 및 탄력성으로 온프레미스 HPC 클러스터 의 애플리케이션 성능을 달성할 수 있습니다 . EFA는 전통적으로 클라우드 기반 HPC 시스템에서 사용하는 TCP 전송보다 지연율이 낮고 일정하며 더 높은 처리량을 제공합니다 . 또한 대규모 HPC 및 기계 학습 애플리케이션에서 중요한 인스턴스 간 통신 성능을 확장합니다 . 이는 기존 AWS 네트워크 인프라에서 작업하도록 최적화되어 애플리케이션 요구량에 따라 크기를 변경합니다 . EC2 배치그룹 워크로드 요구 사항을 충족하기 위해 배치 그룹을 사용하여 상호 의존적 인스턴스 그룹의 배치에 영향 을 줄 수 있다. 워크로드의 유형에 따라 다음 배치 전략 중 하나를 사용하여 배치 그룹을 생성할 수 있다. 클러스터 파티션 분산(스프레드 ) 클러스터 배치 그룹은 단일 가 파티션 배치 그룹은 애플리케 분산형 배치 그룹은 각각 고유 인스턴스 메타데이터 인스턴스 메타데이터는 실행 중인 인스턴스를 구성 또는 관리하는 데 사용될 수 있는 인스턴스 관련 데이터 . 인스턴스 메타데이터는 호스트 이름, 이벤트 및 보안 그룹과 같은 범주로 분류된다 . 인스턴스 메타데이터를 사용하여 인스턴스를 시작할 때 지정한 사용자 데이터에도 액세스할 수 있다. AWS 네트워크 방화벽 (AWS Network Firewall) 모든 Amazon Virtual Private Cloud(VPC) 에 대한 필수 네트워크 보호 기능을 쉽게 배포할 수 있게 해주 는 관리형 서비스 . 네트워크 트래픽에 따라 자동으로 확장되므로 인프라 배포 및 관리 가능. 네트워크 방화벽의 유연한 규 칙 엔진을 사용하면 아웃바운드 서버 메시지 블록(SMB) 요청을 차단하여 악의적인 활동의 확산을 방지 하는 등 네트워크 트래픽을 세밀하게 제어할 수 있는 방화벽 규칙을 정의할 수 있다. 일반적인 오픈 소스 규칙 형식으로 이미 작성한 규칙을 가져오거나 AWS 파트너가 제공하는 호환 규칙 을 가져올 수도 있다."
  },
  {
    "제목": "AWS Network",
    "설명": "Firewall 에는 매우 유연한 규칙 엔진이 있으므로 사용자 지정 방화벽 규칙을 구축하여 고유한 워크로드용 영역 내에 있는 인스턴스의 논리적 그룹. 클러스터 배치 그룹은 동일한 리전의 피어링된 VPC에 걸쳐 적용될 수 있다. 동일한 클러스터 배치 그룹의 인스턴스는 TCP/IP 트래픽에 더 높은 흐름당 처리량 제한을 제공하며 네트워크의 동일한 높은 양방향 대역폭 세그먼트 에 배치된다 .이션에 대한 상관 관계가 있는 하드웨어 장애 가능성을 줄이 는 데 도움이 됨. 배치 그룹 내 두 파티션이 동 일한 랙을 공유하지 않으므로 애플리케이션 내 하드웨어 장 애의 영향을 격리시킬 수 있다.한 하드웨어에 배치된 인스턴 스 그룹이다 . 소규모의 인스턴스 그룹을 다 른 기본 하드웨어로 분산하여 상호 관련 오류를 줄인다 . 짧은 네트워크 지연 시간, 높은 네트워크 처리량 또는 둘 다의 이점을 활용할 수 있는 애플리 케이션에 권장. 대부분의 네트워크 트래픽이 그룹 내 인스턴스 간에 전송되 는 경우에도 권장일반적으로 Hadoop, Cassandra, Kafka 등 대규모의 분산 및 복제된 워크로드에 필 요함.서로 떨어져 있어야 하는 중요 인스턴스의 수가 적은 애플리 케이션에서는 분산형 배치 그 룹이 권장. 를 보호할 수 있다."
  },
  {
    "제목": "AWS Firewall Manager",
    "설명": "AWS Organization 의 여러 계정과 애플리케이션에서 방화벽 규칙을 중앙에서 구성 및 관리할 수 있는 보안 관리 서비스 . Firewall Manager 를 사용하는 경우, 새로운 애플리케이션이 생성될 때 새로운 애플 리케이션 및 리소스가 공통 보안 규칙 세트를 손쉽게 준수하도록 할 수 있다."
  },
  {
    "제목": "AWS Budgets",
    "설명": "예산 비용 또는 사용량을 초과(또는 초과할 것으로 예상)될 때 알려주는 예산을 설정할 수 있다."
  },
  {
    "제목": "AWS Config",
    "설명": "AWS 리소스 인벤토리 , 구성 기록, 구성 변경 알림을 제공하여 보안 및 거버넌스를 실현하는 완벽한 관 리형 서비스 ."
  },
  {
    "제목": "AWS CloudTrail",
    "설명": "이벤트와 구성 변경 사항을 연결할 수 있다. 이 정보를 통해 ‘변경한 사용자 ’, ‘변경한 IP 주소’ 등의 세부 정보에서 AWS 리소스와 관련 리소스에 대 한 변경 결과에 이르기까지 전체적으로 파악할 수 있다. 이 정보를 사용하여 시간 경과에 따라 감사 및 규정 준수 평가에 도움이 되는 보고서를 생성할 수 있다. ​ keyword - 감사 , 검토 , 변경이 없는지 확인 ​ Config 규칙 특정 조건을 충족하는 이벤트가 발생하면 알림이나 Lambda 함수를 실행한다 . Amazon S3 server access logging Amazon S3 버킷에 수행된 요청에 대한 상세 레코드를 제공한다 . 서버 액세스 로그는 많은 애플리케이 션에 있어 유용하다 . 예를 들어 액세스 로그 정보는 보안 및 액세스 감사에 유용할 수 있다. 또한 고객 기반을 이해하고 Amazon S3 청구 비용을 파악할 수 있다."
  },
  {
    "제목": "AWS IAM Identity Center",
    "설명": "직원 사용자를 한 번 생성하거나 연결하고 여러 AWS 계정 및 애플리케이션에 대한 직원 사용자 액세 스를 중앙에서 관리한다 . IAM Identity Center 에서 직접 사용자 아이덴티티를 생성하거나 Microsoft Active Directory 및 Okta Universal Directory 또는 Azure AD와 같은 표준 기반의 ID 제공업체를 비롯하여 기존의 아이덴티티 소스를 연결할 수 있다. identity provider (IdP) 자격 증명 공급자 자격 증명 공급자 (IdP)를 사용하면 AWS 외부의 사용자 자격 증명을 관리할 수 있고 이 외부 사용자 자 격 증명에 계정의 AWS 리소스에 대한 사용 권한을 부여할 수 있다. 기업 사용자 디렉터리처럼 조직 내에 이미 고유의 자격 증명 시스템이 있다면 이 방법이 유용하다 . 그 밖에 AWS 리소스에 액세스해야 하는 모바일 앱이나 웹 애플리케이션을 개발할 때도 효과적이다 . Amazon AppFlow Amazon AppFlow 는 클릭 몇 번으로 Salesforce, SAP, Zendesk, Slack 및 ServiceNow 와 같은 서비스형 소프트웨어 (SaaS) 애플리케이션과 Amazon S3 및 Amazon Redshift 와 같은 AWS 서비스 간에 데이터 를 안전하게 전송할 수 있게 해 주는 완전관리형 통합 서비스이다 . ​ Amazon AppFlow 기능 •AppFlow 를 사용하면 엔터프라이즈급 규모에 원하는 빈도로 즉 일정에 따라, 비즈니스 이벤트 에 대한 응답으로 또는 온디맨드로 데이터 플로우를 실행할 수 있다. •필터링 및 검증과 같은 데이터 변환 기능을 구성하여 추가 단계 없이 플로우 자체의 일부로 바로 사용 가능한 풍부한 데이터를 생성할 수 있다. •AppFlow 는 이동 중의 데이터를 자동으로 암호화하며 사용자가 AWS PrivateLink 와 통합된 SaaS 애플리케이션을 위해 퍼블릭 인터넷상의 데이터 플로우를 제한할 수 있게 해 주므로 보 안 위협에 대한 노출이 감소시킬 수 있다. ​ keyword - SaaS"
  },
  {
    "제목": "AWS Systems Manager",
    "설명": "대규모 인프라 관리 작업을 단순화할 수 있는 플랫폼 서비스 . keyword - 데이터베이스 암호 자동 교체 ​"
  },
  {
    "제목": "AWS Systems Manager Run Command",
    "설명": "AWS Systems Manager 의 기능인 Run Command 를 사용하여 관리형 노드의 구성을 원격으로 안전하 게 관리할 수 있다. Run Command 를 사용하면 일반적인 관리 태스크를 자동화하고 대규모로 일회성 구성 변경을 수행할 수 있다. AWS Management Console, AWS Command Line Interface(AWS CLI), AWS Tools for Windows PowerShell 또는 AWS SDK에서 Run Command 를 사용할 수 있다."
  },
  {
    "제목": "AWS Shield Advanced",
    "설명": "AWS Shield Advanced 는 Amazon EC2 인스턴스 , Elastic Load Balancing 로드 밸런서 , CloudFront 배 포, Route 53 호스팅 영역 및 AWS Global Accelerator 표준 액셀러레이터에 대한 확장된 DDoS 공격 보호 기능을 제공한다 . keyword - 대규모 DDos 공격 Amazon CloudFront .html, .css, .js 및 이미지 파일과 같은 정적 및 동적 웹 콘텐츠를 사용자에게 더 빨리 배포하도 록 지원하는 웹 서비스 . CloudFront 는 엣지 로케이션이라고 하는 데이터 센터의 전 세계 네트워 크를 통해 콘텐츠를 제공한다 . CloudFront 를 통해 서비스하는 콘텐츠를 사용자가 요청하면 지연 시간이 가장 낮은 엣지 로케이션으로 요청이 라우팅되므로 가능한 최고의 성능으로 콘텐츠가 제 공된다 . ​ keyword - 정적, 동적 웹사이트 , 대기시간 성능 개선, 데이터 캐싱 ​ CloudFront 의 캐시 관련 문제 AWS Fargate keyword - 컨테이너화 , 운영 오버헤드 , 관리에 대한 책임X ​ Amazon Rekognition keyword - 부적절한 콘텐츠 감지 ​ Amazon Macie keyword - 개인 식별 정보(PII), 민감한 데이터 ​ S3 버킷 버전관리 / MFA 삭제 keyword - S3 버킷 삭제 방지, 안전한 보안 솔루션 ​ Amazon S3 keyword - 정적 웹사이트 , 고가용성 스토리지 ​ ​ S3 + CloudFront / DynamoDB / Lambda keyword - 확장성 ​ S3수명주기 + S3 Glacier Deep Archive keyword - ~동안은 자주 액세스 . 단 ~이후에는 거의 액세스 안함/무기한 보관 ​ Amazon S3 Intelligent Tiering keyword - 액세스 패턴을 알 수 없거나 예측할 수 없는. ​ ​ NLB keyword - TCP , UDP, 4계층, 전송계층 ​ ALB keyword - HTTP, HTTPS, 7계층 DynamoDB 특정 시간 복구 (PITR) •특정 시점으로 복구를 사용하면 우발적인 쓰기 또는 삭제 작업으로부터 DynamoDB 테이블을 보호 가능. •Amazon DynamoDB 테이블에 대한 온디맨드 백업을 생성하거나 특정 시점으로 복구를 사용 한 연속 백업을 활성화 . •특정 시점으로 복구를 설정해 두면 온디맨드 백업의 생성, 유지 관리, 예약을 걱정할 필요가 없다. •특정 시점 작업은 성능이나 API 지연 시간에 영향을 주지 않는다 . ​ keyword - 데이터 손상의 경우 RPO(복구 시점 목표), RTO(복구 시간 목표) Amazon DynamoDB 온디맨드 Amazon DynamoDB 온디맨드는 용량 계획 없이 초당 수천 개의 요청을 처리할 수 있는 유연한 결제 옵션이다 . DynamoDB 온디맨드는 읽기 및 쓰기 요청에 대해 요청당 지불 요금을 제공하므로 사용한 만큼만 비용 을 지불하면 된다. 온디맨드 모드를 선택하면 DynamoDB 는 워크로드가 이전에 도달한 트래픽 수준으로 증가하거나 감소 할 때 즉시 수용한다 . 워크로드의 트래픽 수준이 새로운 피크에 도달하면 DynamoDB 는 워크로드를 수용하도록 빠 르게 적응한다 . ​ On-demand mode (주문형 모드)가 적합한 환경 •알 수 없는 작업 부하가 있는 새 테이블을 만듭니다 . •예측할 수 없는 애플리케이션 트래픽이 있습니다 . •사용한 만큼만 지불하는 간편한 방식을 선호합니다 . Amazon S3 File Gateway Amazon S3 파일 게이트웨이는 Amazon S3 에 대한 파일 인터페이스를 지원하고 서비스와 가상 소프 트웨어 어플라이언스를 결합한다 . 이 조합을 사용하면 NFS(네트워크 파일 시스템 ) 및 SMB(서버 메시지 블록)와 같은 업계 표준 파일 프 로토콜을 사용하여 Amazon S3에서 객체를 저장하고 검색할 수 있다. •Amazon S3의 파일 스토리지를 간소화하고 업계 표준 파일 시스템 프로토콜을 통해 기존 애 플리케이션에 통합하며 온프레미스 스토리지에 대한 비용 효율적인 대안을 제공 •투명한 로컬 캐싱을 통해 데이터에 대한 대기 시간이 짧은 액세스를 제공 •AWS와의 데이터 전송을 관리하고 , 네트워크 정체로부터 애플리케이션을 버퍼링하고 , 데이터 를 병렬로 최적화 및 스트리밍하고 , 대역폭 소비를 관리 keyword - SMB, NFS ​ ​ 인터넷게이트웨이 수평 확장되고 가용성이 높은 중복 VPC 구성 요소로 , VPC와 인터넷 간에 통신할 수 있게 해준다 . IPv4 트래픽 및 IPv6 트래픽을 지원한다 . 네트워크 트래픽에 가용성 위험이나 대역폭 제약이 발생하지 않는다 . ​ ​ NAT 게이트웨이 NAT 게이트웨이는 NAT(네트워크 주소 변환) 서비스 . 프라이빗 서브넷의 인스턴스가 VPC 외부의 서비 스에 연결할 수 있지만 외부 서비스에서 이러한 인스턴스와의 연결을 시작할 수 없도록 NAT 게이트웨이를 사용할 수 있다. 퍼블릭 프라이빗 (기본값 ) 프라이빗 서브넷의 인스턴스는 퍼블릭 NAT 게이트웨이를 통해 인터넷에 연결할 수 있 지만 인터넷에서 원치 않는 인바운드 연결을 수 신할 수 없습니다 . 퍼블릭 서브넷에서 퍼블릭 NAT 게이트웨이를 생 성하고 생성 시 탄력적 IP 주소를 NAT 게이트웨 이와 연결해야 합니다 . 트래픽을 NAT 게이트웨이에서 VPC용 인터넷 게 이트웨이로 라우팅 또는 퍼블릭 NAT 게이트웨이 를 사용하여 다른 VPC 또는 온프레미스 네트워프라이빗 서브넷의 인스턴스는 프라이빗 NAT 게 이트웨이를 통해 다른 VPC 또는 온프레미스 네 트워크에 연결할 수 있습니다 . 트래픽을 NAT 게이트웨이에서 Transit Gateway 또는 가상 프라이빗 게이트웨이를 통해 트래픽을 라우팅할 수 있습니다 . 탄력적 IP 주소를 프라이빗 NAT 게이트웨이에 연결할 수 없습니다 . 프라이빗 NAT 게이트웨이를 사용하여 VPC에 인 터넷 게이트웨이를 연결할 수 있지만 프라이빗 ​ 가상 프라이빗 게이트웨이 (Virtual Private Gateway) ​ VGW는 가상 사설 네트워크인 VPC와 온프레미스 네트워크를 연결하는 방식 중 가장 오래된 방식이다 . VGW는 VPC와 온프레미스 네트워크를 연결하는 VPC 쪽의 라우터 역할을 한다. VGW를 이용해 온프레스 네트워크와 연결하기 위해서는 온프레미스 네트워크 쪽에 CGW(Customer Gateway) 를 구성해 줘야 한다. ​ VGW의 특징 •GW는 여러 개의 온프레미스 라우터와 연결이 가능합니다 . •다만 VGW는 하나의 VPC에만 연결할 수 있습니다 . •VGW는 Site-to-Site VPN, Direct Connect 연결을 통해 온프레미스 네트워크와 연결이 가능합 니다. •VGW 생성시 동적 라우팅을 사용할 경우 ASN(Autonomous System Number) 를 지정해 줘야합 니다. VPC 게이트웨이 엔드포인트 VPC용 인터넷 게이트웨이 또는 NAT 디바이스가 없어도 Amazon S3 및 DynamoDB 에 대한 안정적인 연결을 제공한다 . 게이트웨이 엔드포인트는 AWS PrivateLink 를 활성화하지 않는다 . 게이트웨이 엔드포인트 사용에 따르 는 추가 요금은 없으며 데이터 전송 및 리소스 사용량에 대한 표준 요금이 그대로 적용된다 . 엔드포인트는 동일한 리전에서만 지원되며 VPC와 다른 리전의 서비스 간에 엔드포인트를 생성할 수 없습니다 . keyword - 인터넷을 통한 이동, 엑세스 X ​ S3 게이트웨이 엔드포인트 VPC에서 Amazon S3 리소스로의 액세스를 이미 설정한 경우, 엔드포인트를 설정한 후에도 Amazon S3 DNS 이름을 사용하여 이러한 리소스에 액세스할 수 있다. ​ ​ Amazon S3 버킷 정책크에 연결할 수 있습니다 . NAT 게이트웨이에서 인터넷 게이트웨이로 트래 픽을 라우팅하는 경우 인터넷 게이트웨이가 트래 픽을 삭제합니다 . 버킷 정책을 사용하여 특정 엔드포인트 , VPC, IP 주소 범위 또는 AWS 계정의 버킷에 대한 액세스를 제어할 수 있다. ​ IAM등 자격 증명과 같은 인증을 사용하지 않고 S3 버킷에 비공개로 연결하도록 Amazon VPC를 구성 하는 방법 : Amazon VPC에서 버킷에 액세스 하는 경우 인증하지 않고 비공개로 S3버킷에 액세스 할 수 있다. 하지만 사용된 VPC 엔드포인트가 Amazon S3를 가르키는지 확인해야 한다. ​ •Amazon S3에 대한 VPC 엔드포인트를 생성 •VPC 엔드포인트에서 액세스를 허용하는 버킷 정책을 추가"
  },
  {
    "제목": "AWS PrivateLink",
    "설명": "지원되는 AWS 서비스 , 기타 AWS 계정에서 호스팅된 서비스 (VPC 엔드포인트 서비스 ) 및 지원되는"
  },
  {
    "제목": "AWS Control Tower",
    "설명": "AWS Control Tower 는 안전한 다중 계정 AWS 환경을 설정하고 관리하는 가장 쉬운 방법을 제공한다 . 잘 설계된 새로운 다중 계정 환경을 쉽게 설정하고 보안, 운영 및 내부 규정 준수를 위한 규칙으로 AWS 워크로드를 관리할 수 있는 단일 위치를 제공한다 . ​ 데이터 상주 가드레일 데이터 상주를 지원하는 일련의 예방 및 탐지 가드레일을 제공한다 . 데이터 상주를 통해 고객 콘텐츠를 호스팅하는 위치를 제어할 수 있다. 이를 통해 여러 지역에서 호스팅할지 또는 정의된 지역에서 제자리에 보관할지 선택할 수 있다. ​ keyword - 규정 준수 요구사항 , ~ 지역만"
  },
  {
    "제목": "AWS DataSync",
    "설명": "AWS로의 데이터 마이그레이션과 온프레미스 스토리지 , 엣지 로케이션 , 다른 클라우드 및 AWS 스토리 지 간의 데이터 이동을 간소화 및 가속화하는 온라인 데이터 이동 및 검색 서비스이다 . ​ •온라인 데이터 전송의 복잡성을 줄이고 비용을 절감 •온프레미스 , 엣지 또는 기타 클라우드 스토리지와 AWS 스토리지 서비스 간, 그리고 AWS 스 토리지 서비스 간 데이터 세트 전송을 간소화 •표준 스토리지 프로토콜 (NFS, SMB)을 사용하거나 HDFS 클라이언트로 또는 Amazon S3 API 를 사용하여 기존 스토리지 시스템 및 데이터 소스에 연결 •특별히 구축된 네트워크 프로토콜과 확장 아키텍처를 사용하여 스토리지 시스템 및 AWS 간 데이터 전송을 가속화 •자동으로 확장하여 파일 및 객체 이동, 데이터 전송 일정 예약, 전송 진행 상황 모니터링 , 암 호화, 데이터 전송 확인 및 문제에 대한 고객 알림을 처리 •최소 약정 또는 선결제 금액 없이 복사된 데이터만큼만 지불"
  },
  {
    "제목": "AWS Direct Connect",
    "설명": "인터넷이 아닌 다른 방법으로 AWS에 연결할 수 있는 네트워킹 서비스 . 인터넷을 통해 전송해야 했던 데이터를 이제는 고객 시설과 AWS 간의 프라이빗 네트워크 연결을 통해 전달할 수 있다. 많은 상황에 서 프라이빗 네트워크 연결은 인터넷 기반 연결보다 비용이 적게 들고 대역폭이 늘어나며 좀 더 일관 된 네트워크 경험을 제공할 수 있다. Amazon Elastic Compute Cloud(EC2), Amazon Virtual Private Cloud(VPC), Amazon Simple Storage Service(S3), Amazon DynamoDB 를 비롯한 모든 AWS 서비스를"
  },
  {
    "제목": "AWS Glue",
    "설명": "분석, 기계 학습 및 애플리케이션 개발을 위해 데이터를 쉽게 탐색, 준비, 그리고 조합할 수 있도록 지 원하는 서버리스 데이터 통합 서비스 ."
  },
  {
    "제목": "AWS Backup",
    "설명": "데이터 보호를 쉽게 중앙 집중화하고 자동화할 수 있는 종합 관리형 서비스 . •대규모 데이터 보호를 더욱 간소화하는 비용 효율적인 완전 관리형 정책 기반 서비스를 제공 •정기적 또는 향후 백업을 예약할 수 있음. •백업 계획에는 리소스에 대한 일정 및 보존 정책이 포함되며 , AWS Backup 은 보존 일정에 따 라 백업을 생성하고 이전 백업을 삭제한다 . •예약 및 삭제를 자동화하여 수동으로 온디맨드 백업을 만들고 삭제하는 획일적인 무거운 작업 을 제거 ​"
  },
  {
    "제목": "AWS DynamoDB",
    "설명": ": 지정 시간 복구(PITR) 및 온디맨드 백업의 두 가지 백업 유형을 제공한다 . PITR은 롤링 35일 창의 특 정 시점으로 테이블을 복구하는 데 사용되며 , 고객이 잘못된 코드, 악의적인 액세스 또는 사용자 오류로부터 실수로 테이블을 삭제하거나 쓰는 것을 완화하는 데 사용된다 . 온 디맨드 백업은 일반적으로 고객이 규정 준수 및 규정 요구 사항을 충족하도록 지원하는 데 사용되 는 장기 보관 및 보존을 위해 설계되었다 . AWS 관리형 서비스 공급자 (MSP) AWS 관리형 서비스 공급자 (MSP) 프로그램은 입증된 레코드와 경험으로 AWS 파트너를 검증하여 계획 및 설계, 구축 및 마이그레이션 , 운영 및 지원, 자동화 및 최적화를 포함하여 클라우드 여정의 모든 단 계에서 고객에게 엔드 투 엔드 AWS 솔루션을 제공한다 . AMI의 launchPermission 속성 각 AMI에는 소유자를 제외하고 해당 AMI를 사용한 인스턴스 시작이 허용된 launchPermission 계정을 설정할 수 있는 AWS 속성이 존재한다 . AMI의 launchPermission 속성을 변경하여 이 AMI를 퍼블릭 설정(모든 AWS 계정에 시작 권한 허용)하 거나 사용자가 지정한 AWS 계정과만 공유할 수 있다. ​AWS Systems Manager OpsCenter AWS 고객이 여러 서비스에 걸친 문제, 이벤트 및 경보 집계 서비스 . 고객은 단일 위치에서 문제를 검토, 조사 및 해결할 수 있으므로 서로 다른 여러 AWS 서비스로 이동 할 필요가 감소된다 . 관리 콘솔에서 문제, 이벤트 및 경보 등의 정보는 OpsItem( 운영 항목)으로 표시되며 컨텍스트 정보, 과 거 기록에 기반한 안내 및 빠른 해결 단계를 제공하며 , 이 기능은 단일 위치에서 주요 조사 데이터를 제공함으로써 , 해결에 소요되는 평균 시간을 단축하고 , 엔지니어의 생산성을 향상하도록 설계되었다 . Saving Plans Savings Plans은 예약 인스턴스보다 훨씬 할인이 포괄적으로 적용된다 . Saving Planse 은 시간당 사용 금액을 미리 약정하고 , 이 약정한 금액에 대해서는 리전, 인스턴스 세대, 사이즈에 상관없이 요금 할인이 적용된다 . S3 Standard-IA 사용도가 다소 낮은경우의 요금제로 , 자주 액세스 하지 않는 데이터를 위한 S3 스토리지 클래스이다 .Compute Saving Plan EC2 인스턴스 Saving Plan 온디맨드 가격 대비 최대 66%할인이 적용되는 가장 유연한 플랜. 인스턴스 패밀리 , 사이즈 , AZ, 리전, OS, 테넌시에 상관없이 적용되는 플랜. EC2와 함께 Fargate 에도 자동 적용됨 .온대민드 가격 대비 최대 72% 할인이 적용되는 플랜. 리전과 인스턴스 패밀리를 정해서 적용하 며, 사이즈 , AZ, OS, 테넌시에 상관없이 적용되 는 플랜. Fargate 는 적용되지 않음. 예약 인스턴스나 EC2 Instance Savings Plans 보 다 훨씬 더 포괄적으로 할인이 적용. 인스턴스 패밀리나 리전을 지정하지 않아도 EC2를 사용하 는 거의 모든 경우에 할인이 적용. 이와 더불어 EC2뿐만 아니라 ECS에서 사용할 수 있는 파게 이트에도 할인이 자동 적용.EC2 Instance Savings Plans 의 경우 리전과 인 스턴스 패밀리를 미리 지정해야함 . 이 방식의 장 점은 Compute Savings Plans 보다 최대 할인 폭 이 조금 더 큼. 보안 그룹 인스턴스에 대한 인바운드 및 아웃바운드 트래픽을 제어하는 가상 방화벽 역할. VPC에서 인스턴스를 시작할 때 최대 5개의 보안 그룹에 인스턴스를 할당할 수 있다. 리소스기반정책 일부 AWS 서비스의 리소스에 인라인 정책을 연결할 수 있다. 리소스 기반 정책의 가장 일반적인 예는 Amazon S3 버킷 정책과 IAM 역할 신뢰 정책이다 . 또 는 Amazon S3 버킷, Amazon SQS 대기열 및 VPC 엔드포인트 AWS Key Management Service 암호화 키에 리소스 기반 정책을 연결할 수 있다. 리소스 기반 정책을 사용하면 이러한 리소스에 액세스할 수 있는 대상 및 해당 대상이 리소스에 서 수행할 수 있는 작업을 지정할 수 있다."
  },
  {
    "제목": "AWS KMS",
    "설명": "WS KMS는 암호화 작업에 사용되는 키를 쉽게 생성하고 제어할 수 있도록 지원하는 관리형 서비스 . 고가용성 키 생성, 스토리지 , 관리 및 감사 솔루션을 제공하므로 , 이를 통해 자체 애플리케이션 내 데이 터를 암호화 또는 디지털 방식으로 서명하거나 , AWS 서비스 전체에서 데이터의 암호화를 제어할 수 있다. ​ 사용자가 생성하는 KMS 키는 고객 관리형 키이다 . KMS 키를 사용하여 서비스 리소스를 암호화하는 AWS 서비스는 종종 사용자를 위해 키를 만든다 . AWS 서비스가 AWS 계정에서 생성하는 KMS 키는 AWS 관리형 키이다 . SSE-S3 SSE-KMS SSE-C Amazon S3 관리형 키를 사용 한 서버 측 암호화 (SSE-S3) 를 사용하면 각 객체는 고유한 키 로 암호화된다 . 또한 추가 보안 조치로 주기적 으로 교체되는 루트 키를 사용 하여 키 자체를 암호화한다 . Amazon S3 서버 측 암호화는 가장 강력한 블록 암호 중 하 나인 256비트 Advanced Encryption Standard(AES-256) 를 사용하여 데이터를 암호화AWS KMS keys를 사용한 서 버 측 암호화 (SSE-KMS) 는 SSE-S3 와 유사하지만 이 서비 스 사용 시 몇 가지 추가적인 이점이 있고 비용이 발생한다 . ​ Amazon S3의 객체에 대한 무 단 액세스에 대응하여 추가적 인 보호를 제공하는 -KMS 키 를 사용하려면 별도의 권한이 필요한다 . SSE-KMS 도 KMS 키가 사용된 고객 제공 키를 사용한 서버 측 암호화 (SSE-C) 를 사용하면 사용자는 암호화 키를 관리하 고 Amazon S3는 암호화 (디스 크에 쓸 때) 및 해독(객체에 액 세스할 때)을 관리한다 . SSE-KMS keyword - 키 감사, 교체 S3 객체 잠금 객체 잠금을 사용하면 객체 버전에 법적 보존을 적용할 수도 있습니다 . 보관 기간과 마찬가지로 법적 보존을 사용하면 객체 버전을 덮어쓰거나 삭제할 수 없다. 그러나 법적 보존에는 연결된 보관 기간이 없고, 제거될 때까지 유효합니다 . 법적 보존은 s3:PutObjectLegalHold 권한을 가진 사용자가 자유롭게 배 치하고 제거할 수 있다. 규정 준수 모드 keyword - 어떤 사용자도 파일 수정, 삭제 X Amazon MQ AWS에서 메시지 브로커를 쉽게 설정하고 운영할 수 있도록 지원하는 Apache ActiveMQ 및 RabbitMQ 용 관리형 메시지 브로커 서비스 . Amazon MQ는 메시지 브로커의 프로비저닝 , 설정, 유지보수를 대신 관리하여 운영 부담을 덜어준다 . 산업 표준 API 및 프로토콜을 사용하여 기존 애플리케이션에 연결하기 때문에 코드를 다시 쓰지 않고 도 AWS로 쉽게 옮길 수 있다. ​한다.때와 사용 주체를 표시하는 감 사 추적 기능을 제공한다 . 또한 고객 관리형 키를 생성하 고 관리하거나 사용자 , 서비스 및 리전에 고유한 AWS 관리형 CMK를 사용할 수 있다. S3 객체 잠금 보관 모드 거버넌스 모드 규정 준수 모드 특별한 권한이 없는 한 사용자는 객체 버전을 덮 어쓰거나 삭제하거나 잠금 설정을 변경할 수 없 다. 거버넌스 모드를 사용하면 대부분의 사용자가 객 체를 삭제하지 못하도록 보호하지만 , 필요에 따 라 일부 사용자에게 보관 설정을 변경하거나 객 체를 삭제할 수 있는 권한을 부여할 수 있다. 규정 준수 모드 보관 기간을 생성하기 전에 거버 넌스 모드를 사용하여 보관 기간 설정을 테스트 할 수도 있다.보호된 객체 버전은 AWS 계정의 루트 사용자를 포함한 어떤 사용자도 덮어쓰거나 삭제할 수 없 다. 규정 준수 모드에서 객체를 잠그면 보관 모드를 변경할 수 없으며 보관 기간을 줄일 수 없다. 규정 준수 모드는 보관 기간 동안 객체 버전을 덮어쓰거나 삭제할 수 없도록 하는 데 도움이 된 다. 고가용성을 위한 Amazon MQ 활성/대기 브로커 : 활성/대기 브로커는 두 개의 서로 다른 가용 영역에 있는 두 개의 브로커가 중복 페어로 구성됩니다 . 이러한 브로커는 애플리케이션 및 Amazon EFS와 동기식으로 통신합니다 . Amazon EFS 스토리지 볼 륨은 데이터를 여러 가용 영역(AZ)에 중복 저장하여 최고 수준의 내구성과 가용성을 제공하도록 설계 되었습니다 . CloudWatch Logs 구독 로그 데이터를 거의 실시간으로 Amazon OpenSearch Service 클러스터로 스트리밍 할 수 있다. 스트리밍되는 로그 데이터의 양에 따라 함수에 함수 수준의 동시 실행 제한을 설정할 수 있습니다 . Amazon OpenSearch Service AWS 클라우드에서 OpenSearch 클러스터를 손쉽게 배포, 운영 및 확장할 수 있도록 해주는 관리형 서 비스. OpenSearch 는 로그 분석, 실시간 애플리케이션 모니터링 , 클릭 스트림 분석 같은 사용 사례를 위한 완 전한 오픈 소스 검색 및 분석 엔진. ​ •클러스터의 리소스를 모두 프로비저닝하고 클러스터를 시작한다 . •실패한 OpenSearch Service 노드를 자동으로 감지한 다음 교체해 자체 관리형 인프라와 관련 된 오버헤드를 줄인다 . •API를 한 번만 호출하거나 콘솔에서 몇 번만 클릭하여 클러스터를 조정할 수 있다."
  },
  {
    "제목": "AWS Firewall Manager",
    "설명": "AWS WAF, AWS Shield Advanced, Amazon VPC 보안 그룹, AWS Network Firewall 및 Amazon Route 53 Resolver DNS 방화벽을 비롯한 다양한 보호를 위해 여러 계정및 리소스에 대한 관리 및 유 지 관리 작업을 간소화한다 . Firewall Manager 를 사용하면 보호를 한 번만 설정하면 새 계정과 리소스 를 추가하는 경우에도 서비스가 자동으로 계정과 리소스 전체에 보호를 적용한다 . ​ keyword - 여러 계정"
  },
  {
    "제목": "AWS WAF",
    "설명": "고객이 정의한 조건에 따라 웹 요청을 허용, 차단 또는 모니터링 (계수)하는 규칙을 구성하여 공격으로 부터 웹 애플리케이션을 보호하는 웹 애플리케이션 방화벽 . 이러한 조건에는 IP 주소, HTTP 헤더, HTTP 본문, URI 문자열 , SQL 명령어 주입 및 교차 사이트 스크립팅이 포함된다 . ​ keyword - SQL 명령어 주입 및 교차 사이트 스트립팅 (XSS) ​AWS Global Accelerator 로컬 및 글로벌 사용자를 위해 애플리케이션 성능을 개선하기 위해 가속기 를 생성하는 서비스이며 , 여 러 AWS 리전에서 엔드포인트를 지원하는 글로벌 서비스 . 표준 액셀러레이터의 경우 Global Accelerator 는 AWS 글로벌 네트워크를 사용하여 구성한 상태, 클라이언트 위치 및 정책을 기반으로 최 적의 리전 엔드포인트로 트래픽을 라우팅하므로 애플리케이션의 가용성이 향상된다 . ​ keyword - 성능, 가용성 개선 향상, 게임 UDP, 고정 IP 주소 AmazonRedshift 완전관리형 확장가능 클라우드데이터 웨어하우스로서 쉽고 빠르고 안전한 대규모 분석을 통해 인사이 트를 얻는 시간을 단축. 수천에 이르는 고객이 Amazon Redshift 를 이용해 테라바이트부터 페타바이트까지의 데이터를 분석하고 복잡한 분석 쿼리를 실행하고 있다. 고객은 운영 데이터베이스 , 데이터 레이크 , 데이터 웨어하우스 및 서드 파티 데이터 집합에 존재하는 모든 데이터에서 실시간 인사이트와 예측 분석 결과를 얻을 수 있 다. ​ keyword - 대규모 , I/O 요청수 축소 Amazon RDS Custom 데이터베이스 관리 작업 및 운영을 자동화합니다 . RDS Custom 은 데이터베이스 관리자가 데이터베이스 환경 및 운영 체제에 액세스하고 사용자 지정할 수 있도록 한다. RDS Custom 을 사용하면 레거시 , 커 스텀 및 패키지 애플리케이션의 요구 사항에 맞게 커스터마이징할 수 있다. ​ keyword - 온프레미스 데이터베이스 관리 Amazon Athena 표준 SQL을 사용하여 Amazon S3(Amazon Simple Storage Service) 에 있는 데이터를 직접 간편 하게 분석할 수 있는 대화형 서버리스 쿼리 서비스 . AWS Management Console 에서 몇 가지 작 업을 수행하면 Athena 에서 Amazon S3에 저장된 데이터를 지정하고 표준 SQL을 사용하여 임시 쿼리를 실행하여 몇 초 안에 결과를 얻을 수 있다. Athena 는 자동으로 확장되어 쿼리를 병렬로 실행하여 대규모 데이터 집합과 복잡한 쿼리에서도 빠르게 결과를 얻을 수 있다. ​ keyword - 쿼리 Amazon Lake Formation 데이터를 쉽게 수집, 정리, 분류, 변환 및 보호하고 분석 및 ML에 사용할 수 있도록 하는 통합 데이터 레이크 서비스 . ​ •데이터 소스를 검색 •Amazon Simple Storage Service(S3) 데이터 레이크로 데이터를 이동하기 위한 변환 작업을 설정 •중복을 제거하고 레코드를 일치시킴 •분석 도구로 액세스할 수 있도록 데이터를 카탈로그화 •데이터 액세스를 구성할 수 있는 중앙 콘솔을 제공 및 보안 정책, AWS 분석 및 ML 서비스의 액세스를 감사 및 제어. Amazon S3 ACL(액세스 제어 목록) Amazon S3 ACL(액세스 제어 목록)로 버킷과 객체에 대한 액세스를 관리한다 . 각 버킷과 객체마다 하 위 리소스로서 연결되어 있는 ACL이 있다. ACL은 액세스를 허용할 AWS 계정이나 그룹과 액세스 유형 을 정의한다 . 리소스에 대한 요청을 수신하면 , Amazon S3는 해당 ACL을 확인해 요청자가 필요한 액세 스 권한을 보유하고 있는지 판단한다 . 데이터에 대한 액세스 제어는 IAM 정책, S3 버킷 정책, Virtual Private Cloud(VPC) 엔드포인트 정책 및"
  },
  {
    "제목": "AWS Elastic Load Balancing",
    "설명": "keyword - SSL 종료 지원 ​ 테이프 게이트웨이 keyword - 가상 테이프 ​ iSCSI(InternetSmallComputerSystemInterface) key word - 보관형 볼륨 게이트웨이 , 캐시형 볼륨 게이트웨이 시간에 따라 액세스가 적어짐 → 캐시형 / 온프레미스에서도 데이터 보존 → 보관형 볼륨 게이트웨이 ​ ​ 스팟 플릿 (스팟 집합) 사용자가 지정한 기준에 따라 시작되는 스팟 인스턴스의 집합이며 선택적으로 온디맨드 인스턴스 집합 (스팟 + 온디맨드 인스턴스 ) ​EBS (Elastic Block Storage) - 블록S3 (Simple Storage Service) - 객체EFS (Elastic File System) - 파 일 공유 EC2에 마운트 가능 EC2에 마운트 불가능 EC2에 마운트 가능 빈번한 읽기/쓰기 추천빈번한 읽기와 때때로의 쓰기 추천빈번한 읽기/쓰기 추천 서비스 붙을 때 AZ 제한 O 서비스 붙을 때 AZ 제한 X 서비스 붙을 때 AZ 제한 X 가격 평균 가격 저렴 가격 비쌈 MySQL 읽기 전용 복제본 작업 원본 DB 인스턴스와 동일한 양의 컴퓨팅 및 스토리지 리소스 ​ Aurora DB 클러스트에 대한 볼륨 복제 Aurora 복제를 사용하면 동일한 Aurora 클러스터 볼륨을 사용하고 원본과 동일한 데이터를 갖는 새 클 러스터를 생성할 수 있다. Aurora 복제 작업은 데이터 손상 위험 없이 프로덕션 데이터를 사용하여 테스트 환경을 신속하게 설정 하는 데 특히 유용하다 . ​ EBS 스냅샷 암호화 액세스할 수 있도록 동일한 KMS 키를 파트너와 공유해야함 . ​ S3 교차 리전 복제(CRR) keyword - S3 , 미국 유럽 공유, 데이터 전송비용 최소화 . ​ Lambda keyword - 수요변동 , 서버리스 (운영 오버헤드 감소), 현대화 ​ ​ DynamoDB keyword - JSON 형식의 데이터 ​ ​ Amazon EC2 Auto Scaling 의 대상 추적 조정 정책 keyword - CPU 사용률 ​ Auto Sacling Group 동일한 사양, 환경 등(동일한 AMI)을 가지고 있는 EC2 인스턴스들의 그룹. keyword - 고가용성 ​ ​ CloudFront 배포를 사용하여 Amazon S3 버킷에 대한 액세스를 제한하는 방법 keyword - CloudFront 원본 액세스 ID(OAI) 생성"
  }
]
