[
  {
    "제목": "AWS Step Functions",
    "설명": "시각적 워크플로를 사용하여 분산 애플리케이션과 마이크로 서비스의 구성 요소를 손쉽게 조정할 수 있게 해주는 완전관리형 서비스 . 각각 기능을 수행하는 개별 구성 요소를 사용하여 애플리케이션을 구축하면 애플리케이션을 빠르고 쉽 게 확장하거나 변경할 수 있다. ​"
  },
  {
    "제목": "AWS X-Ray",
    "설명": "개발자가 프로덕션 분산 애플리케이션 (예: 마이크로 서비스 아키텍처를 사용해 구축된 애플리케이션 )을 분석하고 디버깅하는 데 도움을 주는 서비스."
  },
  {
    "제목": "AWS CloudTrail",
    "설명": "사용자 활동 및 API 사용을 추적하여 감사, 보안 모니터링 및 운영 문제 해결을 지원한다 ."
  },
  {
    "제목": "AWS Batch",
    "설명": "개발자 , 과학자 및 엔지니어가 AWS에서 수많은 배치 컴퓨팅 작업을 효율적으로 손쉽게 실행할 수 있 게 해주는 배치 관리 기능 세트이다. Amazon ECS, Amazon EKS 및 AWS Fargate 를 사용하여 배치 컴퓨팅 워크로드를 계획, 예약 및 실행 하며 스팟 인스턴스를 활용할 수 있는옵션을 제공한다 ."
  },
  {
    "제목": "AWS Network",
    "설명": "Firewall 에는 매우 유연한 규칙 엔진이 있으므로 사용자 지정 방화벽 규칙을 구축하여 고유한 워크로드용 영역 내에 있는 인스턴스의 논리적 그룹. 클러스터 배치 그룹은 동일한 리전의 피어링된 VPC에 걸쳐 적용될 수 있다. 동일한 클러스터 배치 그룹의 인스턴스는 TCP/IP 트래픽에 더 높은 흐름당 처리량 제한을 제공하며 네트워크의 동일한 높은 양방향 대역폭 세그먼트 에 배치된다 ."
  },
  {
    "제목": "AWS Firewall Manager",
    "설명": "AWS Organization 의 여러 계정과 애플리케이션에서 방화벽 규칙을 중앙에서 구성 및 관리할 수 있는 보안 관리 서비스 . Firewall Manager 를 사용하는 경우, 새로운 애플리케이션이 생성될 때 새로운 애플 리케이션 및 리소스가 공통 보안 규칙 세트를 손쉽게 준수하도록 할 수 있다."
  },
  {
    "제목": "AWS Budgets",
    "설명": "예산 비용 또는 사용량을 초과(또는 초과할 것으로 예상)될 때 알려주는 예산을 설정할 수 있다."
  },
  {
    "제목": "AWS Config",
    "설명": "AWS 리소스 인벤토리 , 구성 기록, 구성 변경 알림을 제공하여 보안 및 거버넌스를 실현하는 완벽한 관 리형 서비스 ."
  },
  
  {
    "제목": "AWS IAM Identity Center",
    "설명": "직원 사용자를 한 번 생성하거나 연결하고 여러 AWS 계정 및 애플리케이션에 대한 직원 사용자 액세 스를 중앙에서 관리한다 . IAM Identity Center 에서 직접 사용자 아이덴티티를 생성하거나 Microsoft Active Directory 및 Okta Universal Directory 또는 Azure AD와 같은 표준 기반의 ID 제공업체를 비롯하여 기존의 아이덴티티 소스를 연결할 수 있다."
  },
  {
    "제목": "AWS Systems Manager",
    "설명": "대규모 인프라 관리 작업을 단순화할 수 있는 플랫폼 서비스 . keyword - 데이터베이스 암호 자동 교체 ​"
  },
  {
    "제목": "AWS Systems Manager Run Command",
    "설명": "AWS Systems Manager 의 기능인 Run Command 를 사용하여 관리형 노드의 구성을 원격으로 안전하 게 관리할 수 있다. Run Command 를 사용하면 일반적인 관리 태스크를 자동화하고 대규모로 일회성 구성 변경을 수행할 수 있다. AWS Management Console, AWS Command Line Interface(AWS CLI), AWS Tools for Windows PowerShell 또는 AWS SDK에서 Run Command 를 사용할 수 있다."
  },
  {
    "제목": "AWS Shield Advanced",
    "설명": "AWS Shield Advanced 는 Amazon EC2 인스턴스 , Elastic Load Balancing 로드 밸런서 , CloudFront 배 포, Route 53 호스팅 영역 및 AWS Global Accelerator 표준 액셀러레이터에 대한 확장된 DDoS 공격 보호 기능을 제공한다 . keyword - 대규모 DDos 공격 Amazon CloudFront .html, .css, .js 및 이미지 파일과 같은 정적 및 동적 웹 콘텐츠를 사용자에게 더 빨리 배포하도 록 지원하는 웹 서비스 ."
  },
  {
    "제목": "AWS PrivateLink",
    "설명": "지원되는 AWS 서비스 , 기타 AWS 계정에서 호스팅된 서비스 (VPC 엔드포인트 서비스 )"
  },
  {
    "제목": "AWS Control Tower",
    "설명": "AWS Control Tower 는 안전한 다중 계정 AWS 환경을 설정하고 관리하는 가장 쉬운 방법을 제공한다 . 잘 설계된 새로운 다중 계정 환경을 쉽게 설정하고 보안, 운영 및 내부 규정 준수를 위한 규칙으로 AWS 워크로드를 관리할 수 있는 단일 위치를 제공한다 . ​ 데이터 상주 가드레일 데이터 상주를 지원하는 일련의 예방 및 탐지 가드레일을 제공한다 . 데이터 상주를 통해 고객 콘텐츠를 호스팅하는 위치를 제어할 수 있다. 이를 통해 여러 지역에서 호스팅할지 또는 정의된 지역에서 제자리에 보관할지 선택할 수 있다. ​ keyword - 규정 준수 요구사항 , ~ 지역만"
  },
  {
    "제목": "AWS DataSync",
    "설명": "AWS로의 데이터 마이그레이션과 온프레미스 스토리지 , 엣지 로케이션 , 다른 클라우드 및 AWS 스토리 지 간의 데이터 이동을 간소화 및 가속화하는 온라인 데이터 이동 및 검색 서비스이다 . ​ •온라인 데이터 전송의 복잡성을 줄이고 비용을 절감 •온프레미스 , 엣지 또는 기타 클라우드 스토리지와 AWS 스토리지 서비스 간, 그리고 AWS 스 토리지 서비스 간 데이터 세트 전송을 간소화 •표준 스토리지 프로토콜 (NFS, SMB)을 사용하거나 HDFS 클라이언트로 또는 Amazon S3 API 를 사용하여 기존 스토리지 시스템 및 데이터 소스에 연결 •특별히 구축된 네트워크 프로토콜과 확장 아키텍처를 사용하여 스토리지 시스템 및 AWS 간 데이터 전송을 가속화 •자동으로 확장하여 파일 및 객체 이동, 데이터 전송 일정 예약, 전송 진행 상황 모니터링 , 암 호화, 데이터 전송 확인 및 문제에 대한 고객 알림을 처리 •최소 약정 또는 선결제 금액 없이 복사된 데이터만큼만 지불"
  },
  {
    "제목": "AWS Direct Connect",
    "설명": "인터넷이 아닌 다른 방법으로 AWS에 연결할 수 있는 네트워킹 서비스 . 인터넷을 통해 전송해야 했던 데이터를 이제는 고객 시설과 AWS 간의 프라이빗 네트워크 연결을 통해 전달할 수 있다. 많은 상황에 서 프라이빗 네트워크 연결은 인터넷 기반 연결보다 비용이 적게 들고 대역폭이 늘어나며 좀 더 일관 된 네트워크 경험을 제공할 수 있다. Amazon Elastic Compute Cloud(EC2), Amazon Virtual Private Cloud(VPC), Amazon Simple Storage Service(S3), Amazon DynamoDB 를 비롯한 모든 AWS 서비스를"
  },
  {
    "제목": "AWS Glue",
    "설명": "분석, 기계 학습 및 애플리케이션 개발을 위해 데이터를 쉽게 탐색, 준비, 그리고 조합할 수 있도록 지 원하는 서버리스 데이터 통합 서비스 ."
  },
  {
    "제목": "AWS Backup",
    "설명": "데이터 보호를 쉽게 중앙 집중화하고 자동화할 수 있는 종합 관리형 서비스 . •대규모 데이터 보호를 더욱 간소화하는 비용 효율적인 완전 관리형 정책 기반 서비스를 제공 •정기적 또는 향후 백업을 예약할 수 있음. •백업 계획에는 리소스에 대한 일정 및 보존 정책이 포함되며 , AWS Backup 은 보존 일정에 따 라 백업을 생성하고 이전 백업을 삭제한다 . •예약 및 삭제를 자동화하여 수동으로 온디맨드 백업을 만들고 삭제하는 획일적인 무거운 작업 을 제거 ​"
  },
  {
    "제목": "AWS DynamoDB",
    "설명": ": 지정 시간 복구(PITR) 및 온디맨드 백업의 두 가지 백업 유형을 제공한다 . PITR은 롤링 35일 창의 특 정 시점으로 테이블을 복구하는 데 사용되며 , 고객이 잘못된 코드, 악의적인 액세스 또는 사용자 오류로부터 실수로 테이블을 삭제하거나 쓰는 것을 완화하는 데 사용된다 . 온 디맨드 백업은 일반적으로 고객이 규정 준수 및 규정 요구 사항을 충족하도록 지원하는 데 사용되 는 장기 보관 및 보존을 위해 설계되었다 . AWS 관리형 서비스 공급자 (MSP) AWS 관리형 서비스 공급자 (MSP) 프로그램은 입증된 레코드와 경험으로 AWS 파트너를 검증하여 계획 및 설계, 구축 및 마이그레이션 , 운영 및 지원, 자동화 및 최적화를 포함하여 클라우드 여정의 모든 단 계에서 고객에게 엔드 투 엔드 AWS 솔루션을 제공한다 . AMI의 launchPermission 속성 각 AMI에는 소유자를 제외하고 해당 AMI를 사용한 인스턴스 시작이 허용된 launchPermission 계정을 설정할 수 있는 AWS 속성이 존재한다 . "
  },
  {
    "제목": "AWS KMS",
    "설명": " 암호화 작업에 사용되는 키를 쉽게 생성하고 제어할 수 있도록 지원하는 관리형 서비스 . 고가용성 키 생성, 스토리지 , 관리 및 감사 솔루션을 제공하므로 , 이를 통해 자체 애플리케이션 내 데이 터를 암호화 또는 디지털 방식으로 서명하거나 , AWS 서비스 전체에서 데이터의 암호화를 제어할 수 있다."
  },
  {
    "제목": "AWS Firewall Manager",
    "설명": "AWS WAF, AWS Shield Advanced, Amazon VPC 보안 그룹, AWS Network Firewall 및 Amazon Route 53 Resolver DNS 방화벽을 비롯한 다양한 보호를 위해 여러 계정및 리소스에 대한 관리 및 유 지 관리 작업을 간소화한다 . Firewall Manager 를 사용하면 보호를 한 번만 설정하면 새 계정과 리소스 를 추가하는 경우에도 서비스가 자동으로 계정과 리소스 전체에 보호를 적용한다 . ​ keyword - 여러 계정"
  },
  {
    "제목": "AWS WAF",
    "설명": "고객이 정의한 조건에 따라 웹 요청을 허용, 차단 또는 모니터링 (계수)하는 규칙을 구성하여 공격으로 부터 웹 애플리케이션을 보호하는 웹 애플리케이션 방화벽 . 이러한 조건에는 IP 주소, HTTP 헤더, HTTP 본문, URI 문자열 , SQL 명령어 주입 및 교차 사이트 스크립팅이 포함된다 ."
  },
  {
    "제목": "AWS Elastic Load Balancing",
    "설명": "keyword - SSL 종료 지원 ​ 테이프 게이트웨이 keyword - 가상 테이프 ​ iSCSI(InternetSmallComputerSystemInterface) key word - 보관형 볼륨 게이트웨이 , 캐시형 볼륨 게이트웨이 시간에 따라 액세스가 적어짐 → 캐시형 / 온프레미스에서도 데이터 보존 → 보관형 볼륨 게이트웨이 ​ ​ 스팟 플릿 (스팟 집합) 사용자가 지정한 기준에 따라 시작되는 스팟 인스턴스의 집합이며 선택적으로 온디맨드 인스턴스 집합 (스팟 + 온디맨드 인스턴스 ) ​EBS (Elastic Block Storage) - 블록S3 (Simple Storage Service) - 객체EFS (Elastic File System) - 파 일 공유 EC2에 마운트 가능 EC2에 마운트 불가능 EC2에 마운트 가능 빈번한 읽기/쓰기 추천빈번한 읽기와 때때로의 쓰기 추천빈번한 읽기/쓰기 추천 서비스 붙을 때 AZ 제한 O 서비스 붙을 때 AZ 제한 X 서비스 붙을 때 AZ 제한 X 가격 평균 가격 저렴 가격 비쌈 MySQL 읽기 전용 복제본 작업 원본 DB 인스턴스와 동일한 양의 컴퓨팅 및 스토리지 리소스 ​ Aurora DB 클러스트에 대한 볼륨 복제 Aurora 복제를 사용하면 동일한 Aurora 클러스터 볼륨을 사용하고 원본과 동일한 데이터를 갖는 새 클 러스터를 생성할 수 있다. Aurora 복제 작업은 데이터 손상 위험 없이 프로덕션 데이터를 사용하여 테스트 환경을 신속하게 설정 하는 데 특히 유용하다 ."
  }
]
